module.exports = Object.freeze({
  movieNotFound: 'Фильм с указанным _id не найден.',
  deleteMovie: 'Переданы некорректные данные для удаления фильма.',
  notFound: 'Такой страницы не существует.',
  internalServerError: 'Ошибка сервера. Что-то пошло не так',
  emailDouble: 'Пользователь с таким email уже существует.',
  userNotFound: 'Пользователь с указанным _id не найден.',
  login: 'Указан некорректный email или пароль',
  updateUserBadRequest: 'Переданы некорректные данные для обновления профиля.',
  createMovieBadRequest: 'Переданы некорректные данные при создании фильма.',
  notOwner: 'Невозможно удалить фильм другого пользователя.',
  unauthorized: 'Пользователь не авторизован',
  createUserBadRequest: 'Переданы некорректные данные для создания нового пользователя',
});
